#ОСНОВНІ ТИПИ ДАНИХ
# Створення змінних різних типів
a = "змінна з текстом"
b = 1  # Числова змінна
b1 = 1.1  # Числова змінна (float)
c = ["a", 1, 1.25, "Слово", a]  # Список (List)
d = {"a": "Слово", "b": 1, a: b}  # Словник (Dict)
e = ("a", a)  # Кортеж (Tuple)
f = {"ss", a + str(b)}  # Набір (Set)

# Виведення змінних
print("Змінна a:", a)
print("Змінна b:", b)
print("Список c:", c)
print("Словник d:", d)
print("Кортеж e:", e)
print("Набір f:", f)

#ПРИКЛАДИ ТИПІВ ДАНИХ

# Стрічкові змінні
a = "Це стрічка!"
print(a)
# Якщо нічого не буде внизу, комірка виведе значення змінної
a




b = 'Це також стрічка'
c = '''Стрічка, яка складається з багатьох рядків'''
print(a, b, c)




# Типи змінних та методи для об’єктів
print(type(a))  # <class 'str'>
print(a.upper())  # ЦЕ СТРІЧКА!



# Конкатенація стрічок
a = "3"
b = "6"
print(a + b)  # 36



c = 3  # це вже цифра
print("Це зчеплення стрічок:", a + str(c))  # 33
print("Це вже математична операція додавання чисел:", int(a) + c)  # 6



# Чисельні типи даних
i = 3
print(type(i))  # <class 'int'>


j = 1.1
print(type(j))  # <class 'float'>
print(3 + i, 3 + j)  # 6 4.1



# Робота з пам'яттю
import sys
i += 10_000_000_000
print(sys.getsizeof(i))  # 32


# Арифметичні операції
print(5 / 2, 5 // 2, 5 % 2)  # 2.5 2 1
print(3 ** 2)  # 9


# Колекції: списки
l = [1, "1", 2, "2", "Два", [1, "Один"]]
print(l[0], l[3], l[-1])  # 1 2 [1, 'Один']

l.append(6)  # додавання елемента в кінець списку
l.insert(0, "Початок")  # додавання на конкретну позицію
l.remove("2")  # видалення першого входження елемента
l.pop(3)  # видалення елемента за індексом
print(l)  # ['Початок', 1, '1', 'Два', [1, 'Один'], 6]


# Імітація здачі лабораторних
s = ["Ааа", "Бббб", "Cccc"]
print("Група студентів, які здають роботи:", s)

s_pass = []
s_pass.append(s.pop(0))  # перший студент здав роботу
print("Студенти, які здали:", s_pass)
print("Студенти, які залишились:", s)  # ['Бббб', 'Cccc']

# Словники
d = {"name": 1, 1: "Один", "2": 2}
j = {
    "name": "Програма",
    "version": 1.2,
    "author": "Роман"
}
print(d["2"], j["author"])  # 2 Роман


# Додавання нових ключів та зміна значень
import datetime
j["date"] = datetime.datetime.now()
print(j)

j["version"] = 1.3
j.pop("author")  # видаляємо ключ
print(j)

# Кортежі
t = (2, "2", 6, 8, 2, 6)
print(t[0], "Кількість двійок:", t.count(2))  # 2 Кількість двійок: 2

# Перетворення кортежа в список та модифікація
l = list(t)
l.pop(0)  # видаляємо перший елемент
print("А тепер кількість 2:", l.count(2))  # 1

# Множини (унікальні елементи)
s = set(t)
print(s)  # {8, 2, 6, '2'}
s.remove(6)  # видаляємо елемент
print(s)  # {8, 2, '2'}
